Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallDesignThickness
Represents wall design thickness of rectangle.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
In EN standard it is marked as "d". //Need to be verified!!!!!!!
In ACI standard it is marked as "d". //Need to be verified!!!!!!!
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallNominalThickness
Represents wall nominal thickness of rectangle.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
In EN standard it is marked as "d". //Need to be verified!!!!!!!
In ACI standard it is marked as "d". //Need to be verified!!!!!!!
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Structural Section Pipe.
diameter:
Pipe Diameter.
wallNominalThickness:
Represents wall nominal thickness of rectangle.
wallDesignThickness:
Represents wall design thickness of rectangle.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
Defines parameters for pipes.
Since:
2018